app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "NickyMouse"], ["body", "NickyMouse"], ["user_id", 1], ["created_at", "2017-11-21 13:44:52.150260"], ["updated_at", "2017-11-21 13:44:52.150260"]]
---
  def create
    @post = current_user.posts.build(post_params)
    if @post.save