app/controllers/postcomments_controller.rb

  def create
    params[:postcomment][:post_id] = params[:post_id]
    params[:postcomment][:user_id] = current_user.id
    @comment = Postcomment.create(comment_params)
---
INSERT INTO "postcomments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "okay"], ["post_id", 1], ["user_id", 1], ["created_at", "2017-11-27 10:39:30.608970"], ["updated_at", "2017-11-27 10:39:30.608970"]]

  def find_post
    @post = Post.find(params[:post_id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]